#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.terraform_remote_state.secrets: Reading...
yandex_iam_service_account.s3: Refreshing state... [id=ajejj9j6gednfq88sn4t]
data.terraform_remote_state.secrets: Read complete after 1s
yandex_resourcemanager_folder_iam_member.s3: Refreshing state... [id=b1g0e14had2hltv69li5/storage.admin/serviceAccount:ajejj9j6gednfq88sn4t]
yandex_iam_service_account_static_access_key.s3-static-key: Refreshing state... [id=ajejf8mj4tbec9ctshoq]
yandex_storage_bucket.s3-bucket: Refreshing state... [id=avdeev-terraform-state-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.yandex_vpc_subnet.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_vpc_subnet" "default" {
      + created_at     = (known after apply)
      + description    = (known after apply)
      + dhcp_options   = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "infrastructure-test-ru-central1-a"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
      + v4_cidr_blocks = (known after apply)
      + v6_cidr_blocks = (known after apply)
      + zone           = (known after apply)
    }

  # yandex_compute_instance.web will be created
  + resource "yandex_compute_instance" "web" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "serial-port-enable" = "0"
        }
      + name                      = "web"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd81hgrcv6lsnkremf32"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options {
          + aws_v1_http_endpoint = (known after apply)
          + aws_v1_http_token    = (known after apply)
          + gce_http_endpoint    = (known after apply)
          + gce_http_token       = (known after apply)
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 1
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_vpc_network.infrastructure will be created
  + resource "yandex_vpc_network" "infrastructure" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + description               = "Default VPC network"
      + folder_id                 = "b1g0e14had2hltv69li5"
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "Infrastructure"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.default["infrastructure-test-ru-central1-a"] will be created
  + resource "yandex_vpc_subnet" "default" {
      + created_at     = (known after apply)
      + description    = "test"
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "infrastructure-test-ru-central1-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.0.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.default["infrastructure-test-ru-central1-b"] will be created
  + resource "yandex_vpc_subnet" "default" {
      + created_at     = (known after apply)
      + description    = "test"
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "infrastructure-test-ru-central1-b"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.0.1.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.default["infrastructure-test-ru-central1-c"] will be created
  + resource "yandex_vpc_subnet" "default" {
      + created_at     = (known after apply)
      + description    = "test"
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "infrastructure-test-ru-central1-c"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.0.2.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-c"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @AvdeevArtem, Action: `pull_request`*